tap "hashicorp/tap"
tap "osx-cross/avr"
tap "sachaos/todoist"
tap "xwmx/taps"
brew "bash"
brew "libgit2@1.7"
brew "python@3.12"
brew "glib"
brew "cairo"
brew "chezmoi"
brew "cmake"
brew "eza"
brew "fastfetch"
brew "fd"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "git"
brew "glew"
brew "glfw"
brew "glm"
brew "gnupg"
brew "go"
brew "goenv"
brew "golang-migrate"
brew "node"
brew "gtop"
brew "jq"
brew "libpq"
brew "llvm"
brew "nb"
brew "nodebrew"
brew "openblas"
brew "numpy"
brew "openfortivpn"
brew "openjdk"
brew "openvino"
brew "pinentry-mac"
brew "protobuf"
brew "pwgen"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "qemu"
brew "redis"
brew "ruby-build"
brew "rust"
brew "sl"
brew "telnet"
brew "w-calc"
brew "watch"
brew "wget"
brew "hashicorp/tap/terraform"
brew "osx-cross/avr/avr-gcc@9"
cask "hashicorp-vagrant"
cask "keyclu"
cask "logisim-evolution"
cask "ngrok"
cask "psychopy"
cask "virtualbox"
vscode "42crunch.vscode-openapi"
vscode "akamurasaki.tsharplanguage-color"
vscode "aki77.rails-db-schema"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "angular.ng-template"
vscode "arjun.swagger-viewer"
vscode "avneeshagarwal.react-nextjs-snippets"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "christian-kohler.path-intellisense"
vscode "cjay.ruby-and-rails-snippets"
vscode "cschlosser.doxdocgen"
vscode "dariofuzinato.vue-peek"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "developersoapbox.vscode-springboot-snippets"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "felixfbecker.php-intellisense"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.next-js"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "hridoy.rails-snippets"
vscode "illixion.vscode-vibrancy-continued"
vscode "ionutvmi.path-autocomplete"
vscode "jamiewest.theme-light-vs-mac"
vscode "janisdd.vscode-edit-csv"
vscode "jduponchelle.rainbow-end"
vscode "kaiwood.endwise"
vscode "kakumei.ts-debug"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mrmlnc.vscode-csscomb"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.remote-explorer"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "parallelsdesktop.parallels-desktop"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "pnp.polacode"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rettimo.nextjs-vscode-snippets"
vscode "ritwickdey.liveserver"
vscode "sastan.twind-intellisense"
vscode "searking.preview-vscode"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "smockle.xcode-default-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "titiaiev.vue-docs"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vue.volar"
vscode "wordpresstoolbox.wordpress-toolbox"
vscode "xdebug.php-debug"
vscode "zhuangtongfa.material-theme"
